:properties:
:ID: 20260311T000844
:end:
#+title:      KDOC 554: 『Effective TypeScript』
#+date:       [2026-03-11 Wed 00:08]
#+filetags:   :draft:book:
#+identifier: 20260311T000844

#+begin_comment
(kd/denote-kdoc-rename)
(kd/denote-format)

====ポリシー。
1ファイル1アイデア。
1ファイルで内容を完結させる。
常にほかのエントリとリンクする。
自分の言葉を使う。
参考文献を残しておく。
文献メモの場合は、感想と混ぜないこと。1つのアイデアに反する
ツェッテルカステンの議論に寄与するか。それで本を書けと言われて書けるか
頭のなかやツェッテルカステンにある問いとどのようにかかわっているか
エントリ間の接続を発見したら、接続エントリを追加する。カード間にあるリンクの関係を説明するカード。
アイデアがまとまったらアウトラインエントリを作成する。リンクをまとめたエントリ。
エントリを削除しない。古いカードのどこが悪いかを説明する新しいカードへのリンクを追加する。
恐れずにカードを追加する。無意味の可能性があっても追加しておくことが重要。
個人の感想・意思表明ではない。事実や書籍情報に基づいている

====永久保存メモのルール。
自分の言葉で書く。
後から読み返して理解できる。
他のメモと関連付ける。
ひとつのメモにひとつのことだけを書く。
メモの内容は1枚で完結させる。
論文の中に組み込み、公表できるレベルである。

====水準を満たす価値があるか。
その情報がどういった文脈で使えるか。
どの程度重要な情報か。
そのページのどこが本当に必要な部分なのか。
公表できるレベルの洞察を得られるか

====フロー。
1. 「走り書きメモ」「文献メモ」を書く
2. 1日1回既存のメモを見て、自分自身の研究、思考、興味にどのように関係してくるかを見る
3. 追加すべきものだけ追加する

#+end_comment

* TODO この文書のステータス
:LOGBOOK:
CLOCK: [2026-05-17 Sun 23:31]--[2026-05-17 Sun 23:56] =>  0:25
CLOCK: [2026-05-17 Sun 21:08]--[2026-05-17 Sun 21:33] =>  0:25
CLOCK: [2026-05-17 Sun 20:07]--[2026-05-17 Sun 20:32] =>  0:25
CLOCK: [2026-05-17 Sun 19:32]--[2026-05-17 Sun 19:57] =>  0:25
CLOCK: [2026-05-17 Sun 01:06]--[2026-05-17 Sun 01:31] =>  0:25
CLOCK: [2026-05-17 Sun 00:17]--[2026-05-17 Sun 00:42] =>  0:25
:END:
- 作成
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))
- レビュー
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))

# チェックリスト ================
# 関連をつけた。
# タイトルがフォーマット通りにつけられている。
# 内容をブラウザに表示して読んだ(作成とレビューのチェックは同時にしない)。
# 文脈なく読めるのを確認した。
# おばあちゃんに説明できる。
# いらない見出しを削除した。
# タグを適切にした。
# すべてのコメントを削除した。
* 概要
# 本文(見出しも設定する)

『Effective TypeScript』は、TypeScriptを解説する本である。

* メモ

- すでに複数の異なるプログラミング言語を書き慣れている人にとっては新しい言語に取り組むさい、その言語特有の注意事項から学び始めるのは効果的である。それによって言語に対するメンタルモデルを鍛え上げるとともに言語の特徴を把握できる(まえがき)
- TwoslashはTypeScriptのマークアップフォーマット
- ~type Shape = Square | Rectangle~ の Rectangle は型だが、 ~shape instanceof Rectangle~ は値で、この場合はコンストラクタ関数を指す。型空間のシンボルと値空間のシンボルがある(p15)
  - よくわからない
- 型エラーのあるコードからも出力が生成される。ほかの言語と異なるところ(p15)
- 型演算は実行時の値に影響しない(p16)
- 実行時の型は「宣言された型」と異なる可能性がある(p17)
  - TypeScriptの型なので、実行時には削除される
- TypeScriptで実行時の型が宣言した型と一致しないと、混乱する。「不健全な型」という(p17)
- C++のような言語の同じ名前でシグネチャが異なる関数が定義できる機能をオーバーロードという。TypeScriptではできない(p18)
- 1つの関数には複数の型シグネチャを指定できるが、実装は1つでなければならない。関数のオーバーロード機能は完全に型レベルで存在する(p18)
  - どういったケースで使えるのだろう
- 型は実行時に利用できない。実行時に型をチェックするには型を再構築するなんらかの方法が必要で、一般的にタグ付きユニオンやプロパティのチェックなどの方法がある(p19)
- 関数を書くとき宣言したプロパティを持ち、それ以外のプロパティは持たない引数で呼び出すことを想定してしまいがちである。これは「閉じた型」「シールされた型」と呼ばれ、TypeScriptの型システムでは表現できない。TypeScriptの型は「オープン」である(p21)
- Object.keys()が ~string[]~ で返ってくるのは「開いた型」であるから。オブジェクトのキーの一覧には、型宣言に明示的に列挙されていないフィールドが入っていることもありうるから、文字列で返る(p21)
- JavaScriptがダックタイピングを奨励しているから、TypeScriptはこれをモデリングするため構造的型付けを用いる(p24)
- エディタなどでTypeScriptがそれぞれの時点で変数の型をどのように捉えているかを見ることは、型の拡大と絞り込みに関する直感を養ううえで重要である。条件分岐のなかで変数の型が変化するのを確認することは型システムへの信頼を築くのにきわめて有効である(p30)
- JavaScriptでは歴史的経緯から ~typeof null~ は ~object"~ である(p32)

#+begin_src js
  console.log(typeof null)
#+end_src

#+RESULTS:
#+begin_src
object
undefined
#+end_src

- コードが実行される前にTypeScriptがエラーをチェックしているときには変数は型を持っているだけ。ありえる値の集合と考えられ、この集合は型のドメインと呼ぶ。number型はすべての数値の値の集合と考えられる。通常互換的に語られる「型」と「値の集合」は区別できる(p35)
  - never型は空集合。型階層の1番下に位置することから「ボトム型」と呼ばれることもある
  - 次に小さいのは単一の値を含む集合である。リテラル型が該当する
  - 2つまたは3つの値を持つ型はリテラル型のユニオンとして作れる
- 型チェッカーが行っていることの多くは、ある集合が別の集合の部分集合であるかをテストすること(p36)

#+begin_src typescript
  interface Identified {
    id: string;
  }
#+end_src

- ↑このインターフェースは、その型のドメインに含まれる値を説明している。どちらも満たすならそれはIdentified:
  - 値はオブジェクトか
  - stringに代入可能なidプロパティを持つか
- 型を値の集合として考えると、型に対する演算を理解しやすくなる(p37)
- 型演算は値の集合(型のドメイン)に適用されるのであって、インターフェースのプロパティに適用されるのではない(p37)
  - ~&~ のインターセクションは、プロパティではなく集合への交点である
- ~extends~ は通常、interfaceにフィールドを追加するために使われるが、元の型の値の部分集合になっていればどんな使い方もできる(p38)
  - 元の型のフィールドは ~number | null~ なのを ~number~ に上書きするなど
- 「サブタイプ」とは、ある型のドメインが他の型のドメインの部分集合であることを表現するための別の言い方である(p39)
- TypeScriptは型の等価性をほとんどチェックしない。そのため型のテストを書くのが難しい(p42)
- ~never~ (空の型)の対極にあるのは ~unknown~ である。この型のドメインにはJavaScriptのすべての値が含まれ、すべての型は ~unknown~ に代入可能である。型階層の最上位に位置するためトップ型と呼ばれる(p42)
- 型アサーションも集合として考えられる。サブタイプであれば型アサーションできる。すべての型はunknown型のサブタイプであり、unknownを含む型アサーションは常に可能である(p52)
- 型アサーションはいわゆる「キャスト」とは異なる。Cなどではキャストは実行時に値を変更できるが、型アサーションにはできない。型アサーションは型レベルの構文であり、実行時に消去される。値を変更するわけではない(p53)
  - キャストすると情報が失われる、みたいなことがあるが、そういうことはないことか
- プリミティブはイミュータブルである点とメソッドを持たない点で、オブジェクトと区別される(p53)
- stringプリミティブはメソッドを持たないが、Stringオブジェクトが定義されていて、それが代わりに使われている(p54)

#+caption: ラッパーオブジェクトへの暗黙的変換があるから、プリミティブにプロパティをセットしても消える
#+begin_src js
  x = "hello"
  x.language = 'English'
  console.log(x.language)
#+end_src

#+RESULTS:
#+begin_src
undefined
undefined
#+end_src

- TypeScriptのラッパーオブジェクト型を使用しない。代わりにプリミティブ型を使う(p56)

#+caption: 代入可能性と余剰プロパティチェックは別々に考えるべきである(p57)
#+begin_src typescript
  interface A {
    name: string;
    count: number;
  }
  const r: A = {
    name: 'a',
    count: 1,
    elephant: 1, // 余剰プロパティはエラー
  }

  const obj = {
    name: 'a',
    count: 1,
    elephant: 1,
  } // 推論される型の elephant は string
  const r: A = obj; // OK. Aの elephant は any, obj の型のelephantは string. obj の型に含まれる値の集合はA型の値の部分集合である
#+end_src

#+begin_src twoslash
  const a: string | null = "a"
  //    ^?
  if (a !== null) {
     a
  // ^?
  }
#+end_src

#+RESULTS:
#+begin_src
const a: string | null (line 1)
const a: string (line 3)
#+end_src

#+caption: ミュータブルな配列(a)はreadonlyな配列(b)に代入できる
#+begin_src twoslash
  const a: number[] = [1, 2, 3]
  //    ^?
  const b: readonly number[] = a;
  //    ^?
#+end_src

#+RESULTS:
#+begin_src
const a: number[] (line 1)
const b: readonly number[] (line 2)
#+end_src

#+caption: 逆はそうではない
#+begin_src twoslash
  const b: readonly number[] = [1, 2, 3];
  //    ^?
  const c: number[] = b;
#+end_src

#+RESULTS:
#+begin_src

## Errors were thrown in the sample, but not included in an error tag

These errors were not marked as being expected: 4104.
Expected: // @errors: 4104

Compiler Errors:

index.ts
  [4104] 55 - The type 'readonly number[]' is 'readonly' and cannot be assigned to the mutable type 'number[]'.
#+end_src

- オブジェクトリテラルを既知の型を持つ変数に代入したり関数の引数として渡すと余剰プロパティチェックが行われる。エラーを見つける効果的な方法だが、型チェッカーが行う代入可能性チェックとは異なる(p60)
- 「弱い型」とはオプションプロパティしか持たない型のことである。そのような型では代入可能性チェックをパスするためにプロパティが少なくとも1つ一致しなければならない(p60)
- TypeScriptで関数式を使う利点は、パラメータや戻り値の型を個別指定する代わりに関数全体に対して1度に型宣言を適用できることである。ライブラリはよく使う関数シグネチャを型として提供する(p61)

#+caption: 型宣言の再利用
#+begin_src typescript
  // 重複
  function add1(a: number, b: number) { return a + b; }
  function sub1(a: number, b: number) { return a - b; }
  function mul1(a: number, b: number) { return a * b; }
  function div1(a: number, b: number) { return a / b; }

  // クリア
  type BinaryFn = (a: number, b: number) => number;
  const add2: BinaryFn = (a, b) => a + b;
  const sub2: BinaryFn = (a, b) => a - b;
  const mul2: BinaryFn = (a, b) => a * b;
  const div2: BinaryFn = (a, b) => a / b;
#+end_src

#+RESULTS:
#+begin_src
// 重複
function add1(a, b) { return a + b; }
function sub1(a, b) { return a - b; }
function mul1(a, b) { return a * b; }
function div1(a, b) { return a / b; }
var add2 = function (a, b) { return a + b; };
var sub2 = function (a, b) { return a - b; };
var mul2 = function (a, b) { return a * b; };
var div2 = function (a, b) { return a / b; };
#+end_src

- type と interface のどちらを使うべきか。複雑な型の場合は type (型エイリアス) を使い、そうでない場合は interface を使うのがよい。interface には宣言のマージ、 type には型のインライン化がある(p71)
- ~T[]~ は ~readonly T[]~ よりできることが多いので、 ~T[]~ は ~readonly T[]~ のサブタイプである。つまりミュータブルな配列はreadonlyな配列に代入できる。逆はできない(p75)
- ざっくりとした型(~Map<string, string~)に対してデータ検証を行い、具体的な型を得るというパターンはTypeScriptではよくある(p90)
- (感想)インデックスシグネチャがよくわからない。できるだけ避けたほうがよいのはわかった

#+caption: Recordを使う
#+begin_src twoslash
  type Vec3D = Record<'X' | 'Y' | 'Z', number>;
  //   ^?

  type StringNumber = Record<string, number>;
  //   ^?
  const value: StringNumber = { a: 1, b: 2, c: 3 };
#+end_src

#+RESULTS:
#+begin_src
type Vec3D = {
    X: number;
    Y: number;
    Z: number;
} (line 1)
type StringNumber = {
    [x: string]: number;
} (line 3)
const value: StringNumber (line 4)
#+end_src

#+caption: const と let の型推論の違い。letで宣言された変数にプリミティブ値を代入するとその「基本型」に拡大される(p109)
#+begin_src twoslash
  const x = 'x';
  //    ^?
  let y = 'y';
  //  ^?
#+end_src

#+RESULTS:
#+begin_src
const x: "x" (line 1)
let y: string (line 2)
#+end_src

#+caption: 配列の型推論(p109)
#+begin_src twoslash
  const mixed = ['x', 1];
  //    ^?
#+end_src

#+RESULTS:
#+begin_src
const mixed: (string | number)[] (line 1)
#+end_src

#+caption: as constと書くと、その値について可能なかぎり狭い型を推論する。型の拡大は起こらない(p111)
#+begin_src twoslash
  const arr1 = [1, 2, 3]
  //    ^?
  const arr2 = [1, 2, 3] as const
  //    ^?
#+end_src

#+RESULTS:
#+begin_src
const arr1: number[] (line 1)
const arr2: readonly [1, 2, 3] (line 2)
#+end_src

#+caption: これはOK。例は下に続く(p125)
#+begin_src twoslash
type Language = 'JavaScript' | 'TypeScript' | 'Python';
function setLanguage(language: Language) {}
setLanguage('JavaScript')
#+end_src

#+RESULTS:
#+begin_src

#+end_src

#+caption: 初期化のタイミングで型を推論しなければならないのでstringが推論されるが、これはLanguageに代入できない(p126)
#+begin_src twoslash
type Language = 'JavaScript' | 'TypeScript' | 'Python';
function setLanguage(language: Language) {}
let language = 'JavaScript'
setLanguage(language)
#+end_src

#+RESULTS:
#+begin_src

## Errors were thrown in the sample, but not included in an error tag

These errors were not marked as being expected: 2345.
Expected: // @errors: 2345

Compiler Errors:

index.ts
  [2345] 140 - Argument of type 'string' is not assignable to parameter of type 'Language'.
#+end_src

#+caption: constにすると変数は変更できないことが型チェッカーに伝わり、より正確な型を推論できる(p126)
#+begin_src twoslash
type Language = 'JavaScript' | 'TypeScript' | 'Python';
function setLanguage(language: Language) {}
const language = 'JavaScript'
//    ^?
setLanguage(language)
#+end_src

#+RESULTS:
#+begin_src
const language: "JavaScript" (line 3)
#+end_src

#+caption: 空の配列の型は、異なる要素を追加することで大きくできる(p131)
#+begin_src twoslash
  const result = [];
  //    ^?
  result.push('a');
  result
  // ^?
  result.push(1);
  result
  // ^?
#+end_src

#+RESULTS:
#+begin_src
const result: any[] (line 1)
const result: string[] (line 3)
const result: (string | number)[] (line 5)
#+end_src

- TypeScriptによって拒否されたPromiseによって投げられる例外は型をもたない(p140)

#+caption: async関数は常にPromiseを返す
#+begin_src twoslash
async function getNumber1() { return 42 }
//             ^?
const getNumber2 = async () => 42
//    ^?
const getNumber3 = () => Promise.resolve(42)
//    ^?
#+end_src

#+RESULTS:
#+begin_src
function getNumber1(): Promise<number> (line 1)
const getNumber2: () => Promise<number> (line 2)
const getNumber3: () => Promise<number> (line 3)
#+end_src

- promiseにするのは重要なルールの強制のためである。関数には常に同期的に結果を返すか、常に非同期的に結果を返すかすべきで、状況によって同期的に結果を返したり非同期的に結果を返したりしてはいけない(p141)

* 関連
# 関連するエントリ。書いているファイルから見て、なぜ関連させたか書く。意味のあるつながりを意識的につくる。
# [引用、整合性、どう説明できるか、矛盾、補っているか、以前聞いたこと、対立、修正、補足、付け加え、組み合わせ、疑問]
# また、現在はリンクが見つからなくてもこういった切り口で将来関連させられそうな項目を書いておく
# [類推、未解決、具体例、追加調査、理由、動機、検証]
# 横に類推するか、上に抽象化するか、下に具体化するか

なし。
